# ASSIGNMENT 18 - PANDAS ADV 1 - DSM2.0 - PWSKILLS

### Q1. List any five functions of the pandas library with execution.

In [1]:
import pandas as pd

1. `pd.read_csv()` - to read csv files in pandas we use this function.

In [3]:
df= pd.read_excel("pandas.xlsx")

In [4]:
df

           Product Customer    Qtr 1  Qtr 2   Qtr 3    Qtr 4
0     Alice Mutton    ANTON     0.00  702.0    0.00     0.00
1     Alice Mutton    BERGS   312.00    0.0    0.00     0.00
2     Alice Mutton    BOLID     0.00    0.0    0.00  1170.00
3     Alice Mutton    BOTTM  1170.00    0.0    0.00     0.00
4     Alice Mutton    ERNSH  1123.20    0.0    0.00  2607.15
..             ...      ...      ...    ...     ...      ...
272  Veggie-spread    FOLIG     0.00    0.0    0.00  1317.00
273  Veggie-spread    HUNGO   921.37    0.0    0.00     0.00
274  Veggie-spread    MORGK     0.00  263.4    0.00     0.00
275  Veggie-spread    PICCO     0.00    0.0    0.00   395.10
276  Veggie-spread    WHITC     0.00    0.0  842.88     0.00

[277 rows x 6 columns]

2. `df.head()` - to display n rows from the top of the dataframe.

In [5]:
df.head()

        Product Customer   Qtr 1  Qtr 2  Qtr 3    Qtr 4
0  Alice Mutton    ANTON     0.0  702.0    0.0     0.00
1  Alice Mutton    BERGS   312.0    0.0    0.0     0.00
2  Alice Mutton    BOLID     0.0    0.0    0.0  1170.00
3  Alice Mutton    BOTTM  1170.0    0.0    0.0     0.00
4  Alice Mutton    ERNSH  1123.2    0.0    0.0  2607.15

In [6]:
df.head(3)

        Product Customer  Qtr 1  Qtr 2  Qtr 3   Qtr 4
0  Alice Mutton    ANTON    0.0  702.0    0.0     0.0
1  Alice Mutton    BERGS  312.0    0.0    0.0     0.0
2  Alice Mutton    BOLID    0.0    0.0    0.0  1170.0

3. `df.tail()` - to display n rows fomr the bottom of the dataframe.

In [7]:
df.tail(4)

           Product Customer   Qtr 1  Qtr 2   Qtr 3  Qtr 4
273  Veggie-spread    HUNGO  921.37    0.0    0.00    0.0
274  Veggie-spread    MORGK    0.00  263.4    0.00    0.0
275  Veggie-spread    PICCO    0.00    0.0    0.00  395.1
276  Veggie-spread    WHITC    0.00    0.0  842.88    0.0

4. `df.describe()` - to see the defult statistics by the pandas module of the dataframe.

In [8]:
df.describe()

             Qtr 1        Qtr 2        Qtr 3        Qtr 4
count   277.000000   277.000000   277.000000   277.000000
mean     88.855271   156.805199   150.327581   161.744621
std     254.991062   389.259507   433.856409   386.840078
min       0.000000     0.000000     0.000000     0.000000
25%       0.000000     0.000000     0.000000     0.000000
50%       0.000000     0.000000     0.000000     0.000000
75%       0.000000    96.500000     0.000000   110.400000
max    2281.500000  3159.000000  3900.000000  2700.000000

5. `pd.Categorical(df['column_name'])` - to see all the unique values in a particulat column.

In [10]:
pd.Categorical(df['Qtr 1'])

[0.0, 312.0, 0.0, 1170.0, 1123.2, ..., 0.00, 921.37, 0.00, 0.00, 0.00]
Length: 277
Categories (56, float64): [0.00, 24.82, 26.46, 27.00, ..., 1123.2, 1170.0, 1550.4, 2281.5]

### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [ ]:
def reset_index(df):
    df.reindex(list(range(1, len(df)*2+1, 2)))

### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

In [26]:
def sum_values(df):
    sum =0
    for i in range(0, 3):
        sum = sum + df["Qtr 1"][i]
    print(sum)
    
sum_values(df)

### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [ ]:
df['word_count'] = df3['Text'].apply(lambda x :len(x.split()))

### Q5. How are DataFrame.size() and DataFrame.shape() different?

`df.size` - return the number of elements in the dataframe, df.size = number of rows * number of columns.

`df.shape` - return the number of rows and number of columns in a dataframe.

### Q6. Which function of pandas do we use to read an excel file?

`pd.read_excel()` - Function is used to read the excel file in pandas module.

### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

In [44]:
def username(df):
    df["Username"] = df["Email"].apply(lambda x: x[:-11])

### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [64]:
def func(df):
    rows = df[(df['A']>5) & (df['B']<10)]
    return rows

In [66]:
di = {"A":[3,8,6,2,9], "B":[5,2,9,3,1], "C":[1,7,4,5,2]}
df1 = pd.DataFrame(di)

In [67]:
df1

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [68]:
func(df1)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,median, and standard deviation of the values in the 'Values' column.

In [74]:
def mean_median_std(df):
    print("The mean is \n", df.mean())
    print("The median is \n", df.median())
    print("The standard deviation is\n", df.std())

### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [76]:
def moving_average(df):
    window_size = 7
    df["Moving_Average"] = df['Sales'].rolling(window=window_size).mean()+df["Date"]["Day"]

### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

pip install pandas

The `pandas` library is to be installed for any or basic finctions in pandas.